/*12.Составление логических выражений
b.	Записать условие, которое является истинным, когда:
	1.	каждое из чисел А и В больше 100;
	2.	только одно из чисел А и В четное;
	3.	хотя бы одно из чисел А и В положительно;
	4.	каждое из чисел А, В, С кратно трем;
	5.	только одно из чисел А, В и С меньше 50;
	6.	хотя бы одно из чисел А, В, С отрицательно.
*/

#include <stdio.h>

int main()
{
	int a,b,c;
// --------------------B.1---------------------------
	printf("A = ");
	scanf("%d",&a);
	printf("B = ");
	scanf("%d",&b);
	printf("B.1) = %d \n",(a > 100) && (b > 100));
// ---------------------B.2---------------------------	
	printf("A = ");
	scanf("%d",&a);
	printf("B = ");
	scanf("%d",&b);
	printf("B.2) = %d \n",(a % 2 == 0) || (b % 2 == 0));
// --------------------B.3---------------------------
	printf("A = ");
	scanf("%d",&a);
	printf("B = ");
	scanf("%d",&b);
	printf("B.3) = %d \n",(a >= 0 ) || (b >= 0));
// ---------------------B.4---------------------------	
	printf("A = ");
	scanf("%d",&a);
	printf("B = ");
	scanf("%d",&b);
	printf("C = ");
	scanf("%d",&c);
	printf("B.4) = %d \n",(a % 3 == 0) && (b % 3 == 0) && (c % 3 == 0));
// --------------------B.5---------------------------
	printf("A = ");
	scanf("%d",&a);
	printf("B = ");
	scanf("%d",&b);
	printf("C = ");
	scanf("%d",&c);
	printf("B.5) = %d \n", (a < 50 && b > 50 && c > 50) ||( a > 50 && b < 50 && c > 50 )|| (a > 50 && b > 50 && c < 50));
// ---------------------B.6---------------------------	
	printf("A = ");
	scanf("%d",&a);
	printf("B = ");
	scanf("%d",&b);
	printf("C = ");
	scanf("%d",&c);
	printf("B.6) = %d \n",(a < 0 && b >= 0 && c >= 0) || (a >= 0 && b < 0 && c >= 0)|| (a >= 0 && b >= 0 && c < 0 ));

	


return 0;

}
